export const apiHost = 'https://topuphub.top'
// export const apiHost = 'http://dbt971.top'

export const appId = 'topuphubYIW5MTXU5tglVWjK'

export const appSecret = 'LaPGqlPtzeqPrWkt'

export const concatPhone = '400-6977707'

export const concatQQ = '3599581998'

export const mallMiniAppId = 'wx50974afb2488d5ef'

export const prompt = {
  mobile_phone_credits: [
    '请勿对已注销卡进行充值，如造成损失，本平台概不负责！',
    '由于运营商限制，相同运营商且相同金额的充值，需间隔10分钟以上才能再次充值；',
    '先请确认运营商和号码是否匹配且正确,再选择适合的金额支付充值，充值成功不可更改和退款；',
    '充值过程遇到问题，请及时联系客服;'
  ],
  mobile_phone_data: [
    '请勿对已注销卡进行充值，如造成损失，本平台概不负责！',
    '由于运营商限制，相同运营商且相同金额的充值，需间隔10分钟以上才能再次充值；',
    'Flexi Prepaid 用户不可通过本平台充值流量。如果充值成功，充值金额将等量充值到用户Flexi Prepaid 余额中，请自行使用Flexi Prepaid 余额充值；',
    '先请确认运营商和号码是否匹配且正确,再选择适合的金额支付充值，充值成功不可更改和退款；',
    '充值过程遇到问题，请及时联系客服;'
  ],
  internet_credits: [
    '由于运营商限制，相同运营商且相同金额的充值，需间隔10分钟以上才能再次充值；',
    '先请确认运营商和号码是否匹配且正确,再选择适合的金额支付充值，充值成功不可更改和退款；',
    '充值过程遇到问题，请及时联系客服;'
  ],
  prepaid_card_credits: [
    '由于运营商限制，相同运营商且相同金额的充值，需间隔10分钟以上才能再次充值；',
    '充值卡产品，购买成功后可在 我的-充值订单-订单详情 里查看购买所得的充值码/PIN码，然后用充值码/PIN码进行后续充值；',
    '先请确认运营商和号码是否匹配且正确,再选择适合的金额支付充值，充值成功不可更改和退款；',
    '充值过程遇到问题，请及时联系客服;'
  ],
  salik_pin: [
    '由于运营商限制，相同运营商且相同金额的充值，需间隔10分钟以上才能再次充值；',
    '先请确认运营商和号码是否匹配且正确,再选择适合的金额支付充值，充值成功不可更改和退款；',
    '充值过程遇到问题，请及时联系客服;'
  ],
  dubai_fine: [
    '由于运营商限制，相同运营商且相同金额的充值，需间隔10分钟以上才能再次充值；',
    '先请确认运营商和号码是否匹配且正确,再选择适合的金额支付充值，充值成功不可更改和退款；',
    '充值过程遇到问题，请及时联系客服;'
  ]
}